// TODO:
// 1. Рефакторинг форм. В идеале логику разделить на один компонент, а вёрстку по разным.
// 2. Украсить Sidebar. !!!DONE
// 3. Подумать с айдишниками в firestore. Мб как-то можно поставить названия продуктов.  !!!DONE
// 4. MAYBE: Добавить регистрацию пользователей(не в админку). Отслеживание пользователей, сортировка.
// 5. Добавить лоадер при добавлении товара. !!!DONE
// 6. Очистка формы после добавления товара.  !!!DONE
// 7. Переделать иконки sidebar на fontawesome. !!!DONE
// 8. Переделать айдишники. Сейчас при апдейте дока, айдишник остаётся со старым названием продукта. На чё переделать хуй его знает !!!!DONE
// 9. Рефакторинг formChooser и changeFormChooser. Получать компонент через <component :is=> и route.
// 10. Убрать проверку american, italian в данных при отправке. В дальнейшем в проекте проверять их наличие через americanSizes? italianSizes?
// 11. Валидация форм. Vuelidate?
